[
  {
    "id": "b001",
    "title": "Atomic Habits",
    "author": "James Clear",
    "category": "Self Help",
    "description": "Transform your life with tiny changes that deliver remarkable results. James Clear reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results.",
    "summary": "Atomic Habits provides a proven framework for improving every day. James Clear draws on the most proven ideas from biology, psychology, and neuroscience to create an easy-to-understand guide for making good habits inevitable and bad habits impossible.",
    "keyLessons": [
      "Small habits compound over time to produce remarkable results",
      "Focus on systems rather than goals",
      "Make good habits obvious, attractive, easy, and satisfying",
      "Break bad habits by making them invisible, unattractive, hard, and unsatisfying",
      "Identity-based habits are more powerful than outcome-based habits"
    ],
    "cover": "resources/book-covers/atomic-habits.jpg",
    "pages": 320,
    "rating": 4.8,
    "reviews": 15420,
    "price": 12.99,
    "accessLevel": "premium",
    "publishDate": "2018-10-16",
    "tags": ["habits", "productivity", "personal development"],
    "previewPages": 15
  },
  {
    "id": "b002",
    "title": "The Psychology of Money",
    "author": "Morgan Housel",
    "category": "Money",
    "description": "Timeless lessons on wealth, greed, and happiness. Morgan Housel shares 19 short stories exploring the strange ways people think about money and teaches you how to make better sense of one of life's most important topics.",
    "summary": "The Psychology of Money explores how money works in the real world. Through 19 short stories, Morgan Housel shows that financial success is not a hard science but a soft skill where how you behave is more important than what you know.",
    "keyLessons": [
      "Financial success is more about behavior than intelligence",
      "The power of compounding is underestimated",
      "Getting wealthy and staying wealthy require different skills",
      "The most important part of every plan is planning on your plan not going according to plan",
      "Wealth is what you don't see - money not spent"
    ],
    "cover": "resources/book-covers/psychology-money.jpg",
    "pages": 256,
    "rating": 4.7,
    "reviews": 8930,
    "price": 14.99,
    "accessLevel": "premium",
    "publishDate": "2020-09-08",
    "tags": ["finance", "investing", "behavior"],
    "previewPages": 12
  },
  {
    "id": "b003",
    "title": "Rich Dad Poor Dad",
    "author": "Robert T. Kiyosaki",
    "category": "Money",
    "description": "What the Rich Teach Their Kids About Money That the Poor and Middle Class Do Not! The #1 personal finance book of all time that challenges traditional beliefs about money and investing.",
    "summary": "Rich Dad Poor Dad tells the story of Robert Kiyosaki and his two dads—his real father (poor dad) and the father of his best friend (rich dad)—and the ways in which both men shaped his thoughts about money and investing.",
    "keyLessons": [
      "The rich don't work for money, they make money work for them",
      "Financial education is more important than formal education",
      "Assets put money in your pocket, liabilities take money out",
      "The difference between good debt and bad debt",
      "Why savers are losers and how to think like the rich"
    ],
    "cover": "resources/book-covers/rich-dad-poor-dad.jpg",
    "pages": 336,
    "rating": 4.5,
    "reviews": 18250,
    "price": 11.99,
    "accessLevel": "free",
    "publishDate": "1997-04-01",
    "tags": ["wealth", "investing", "financial education"],
    "previewPages": 20
  },
  {
    "id": "b004",
    "title": "The 7 Habits of Highly Effective People",
    "author": "Stephen R. Covey",
    "category": "Self Help",
    "description": "Powerful lessons in personal change. Stephen R. Covey's groundbreaking book has transformed the lives of presidents and CEOs, educators, and parents worldwide.",
    "summary": "The 7 Habits of Highly Effective People presents a principle-centered approach for solving personal and professional problems. With penetrating insights and pointed anecdotes, Covey reveals a step-by-step pathway for living with fairness, integrity, honesty, and human dignity.",
    "keyLessons": [
      "Be proactive and take responsibility for your life",
      "Begin with the end in mind and define your mission",
      "Put first things first and prioritize effectively",
      "Think win-win and seek mutual benefit",
      "Seek first to understand, then to be understood",
      "Synergize and create cooperation",
      "Sharpen the saw and practice self-renewal"
    ],
    "cover": "resources/book-covers/7-habits.jpg",
    "pages": 372,
    "rating": 4.6,
    "reviews": 22100,
    "price": 13.99,
    "accessLevel": "premium",
    "publishDate": "1989-08-15",
    "tags": ["effectiveness", "leadership", "personal development"],
    "previewPages": 18
  },
  {
    "id": "b005",
    "title": "Think and Grow Rich",
    "author": "Napoleon Hill",
    "category": "Motivation",
    "description": "The Landmark Bestseller Now Revised and Updated for the 21st Century. Napoleon Hill's classic book has helped millions of people achieve their goals and dreams.",
    "summary": "Think and Grow Rich is Napoleon Hill's masterpiece, based on his study of 500 millionaires who started from nothing. The book reveals the 13 steps to riches that Hill identified as the common denominator among all successful people.",
    "keyLessons": [
      "Desire is the starting point of all achievement",
      "Faith is a state of mind that can be induced by affirmation",
      "Auto-suggestion can influence the subconscious mind",
      "Specialized knowledge is more valuable than general knowledge",
      "Imagination is the workshop of the mind",
      "Organized planning leads to success",
      "Persistence is a state of mind that can be cultivated"
    ],
    "cover": "resources/book-covers/think-grow-rich.jpg",
    "pages": 238,
    "rating": 4.4,
    "reviews": 15680,
    "price": 10.99,
    "accessLevel": "free",
    "publishDate": "1937-01-01",
    "tags": ["success", "wealth", "mindset"],
    "previewPages": 25
  },
  {
    "id": "b006",
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "category": "Fiction",
    "description": "A timeless tale of love, marriage, and society in Regency England. Jane Austen's masterpiece follows Elizabeth Bennet as she navigates issues of manners, upbringing, morality, and marriage.",
    "summary": "Pride and Prejudice tells the story of Elizabeth Bennet, the second of five daughters of a country gentleman living in Longbourn, near London. When the wealthy and handsome Mr. Darcy arrives in their neighborhood, Elizabeth's prejudice and his pride must be overcome if they are to find happiness together.",
    "keyLessons": [
      "First impressions can be misleading",
      "Pride and prejudice are obstacles to understanding",
      "True love transcends social class",
      "Personal growth requires self-reflection",
      "Integrity and character matter more than wealth"
    ],
    "cover": "resources/book-covers/pride-prejudice.jpg",
    "pages": 432,
    "rating": 4.7,
    "reviews": 28950,
    "price": 9.99,
    "accessLevel": "free",
    "publishDate": "1813-01-28",
    "tags": ["romance", "classics", "society"],
    "previewPages": 30
  },
  {
    "id": "b007",
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "category": "Fiction",
    "description": "A classic American novel set in the Jazz Age, exploring themes of decadence, idealism, resistance to change, social upheaval, and excess.",
    "summary": "The Great Gatsby follows a cast of characters living in the fictional towns on Long Island in the summer of 1922. The story primarily concerns the young and mysterious millionaire Jay Gatsby and his quixotic passion and obsession with the beautiful former debutante Daisy Buchanan.",
    "keyLessons": [
      "The American Dream can be corrupted by materialism",
      "The past cannot be recreated",
      "Wealth doesn't guarantee happiness",
      "Social class divisions are difficult to overcome",
      "Idealism can lead to destruction"
    ],
    "cover": "resources/book-covers/great-gatsby.jpg",
    "pages": 180,
    "rating": 4.3,
    "reviews": 19800,
    "price": 8.99,
    "accessLevel": "free",
    "publishDate": "1925-04-10",
    "tags": ["american dream", "jazz age", "tragedy"],
    "previewPages": 22
  },
  {
    "id": "b008",
    "title": "JavaScript: The Definitive Guide",
    "author": "David Flanagan",
    "category": "Technology",
    "description": "The ultimate guide to JavaScript programming. This comprehensive reference covers the language from the ground up, including the latest features and best practices.",
    "summary": "JavaScript: The Definitive Guide is the most comprehensive book on JavaScript programming. It covers the language from basic syntax to advanced concepts, including DOM manipulation, event handling, and modern ES6+ features.",
    "keyLessons": [
      "Master JavaScript fundamentals and advanced concepts",
      "Understand the DOM and browser APIs",
      "Learn modern ES6+ features and best practices",
      "Implement effective error handling and debugging",
      "Build scalable and maintainable JavaScript applications"
    ],
    "cover": "resources/book-covers/javascript-definitive.jpg",
    "pages": 704,
    "rating": 4.6,
    "reviews": 3250,
    "price": 49.99,
    "accessLevel": "premium",
    "publishDate": "2020-05-15",
    "tags": ["programming", "web development", "javascript"],
    "previewPages": 25
  },
  {
    "id": "b009",
    "title": "Clean Code",
    "author": "Robert C. Martin",
    "category": "Technology",
    "description": "A Handbook of Agile Software Craftsmanship. Essential reading for any software developer who wants to write better, more maintainable code.",
    "summary": "Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code—of transforming a code base that has some problems into one that is sound and efficient.",
    "keyLessons": [
      "Write code that is readable and maintainable",
      "Follow SOLID principles of object-oriented design",
      "Practice test-driven development",
      "Refactor code to improve quality",
      "Use meaningful names and consistent formatting"
    ],
    "cover": "resources/book-covers/clean-code.jpg",
    "pages": 464,
    "rating": 4.8,
    "reviews": 5420,
    "price": 39.99,
    "accessLevel": "premium",
    "publishDate": "2008-08-01",
    "tags": ["software development", "programming", "best practices"],
    "previewPages": 20
  },
  {
    "id": "b010",
    "title": "The Intelligent Investor",
    "author": "Benjamin Graham",
    "category": "Trading",
    "description": "The Definitive Book on Value Investing. The greatest investment advisor of the twentieth century, Benjamin Graham, taught and inspired people worldwide.",
    "summary": "The Intelligent Investor is the classic text on value investing. Benjamin Graham's philosophy of 'value investing' shields investors from substantial error and teaches them to develop long-term strategies with which they will be comfortable down the road.",
    "keyLessons": [
      "Invest with a margin of safety",
      "Mr. Market is your servant, not your guide",
      "Distinguish between investment and speculation",
      "The importance of thorough analysis",
      "Long-term thinking over short-term gains"
    ],
    "cover": "resources/book-covers/intelligent-investor.jpg",
    "pages": 640,
    "rating": 4.5,
    "reviews": 8750,
    "price": 24.99,
    "accessLevel": "premium",
    "publishDate": "1949-01-01",
    "tags": ["investing", "value investing", "stock market"],
    "previewPages": 15
  },
  {
    "id": "b011",
    "title": "A Random Walk Down Wall Street",
    "author": "Burton G. Malkiel",
    "category": "Trading",
    "description": "The Time-Tested Strategy for Successful Investing. A comprehensive guide to various investment strategies and the efficient market hypothesis.",
    "summary": "A Random Walk Down Wall Street examines the full range of investment opportunities, from stocks, bonds, and money markets to real estate investment trusts, home ownership, and tangible assets such as gold and collectibles.",
    "keyLessons": [
      "Markets are generally efficient and difficult to beat",
      "Diversification is key to reducing risk",
      "Index funds often outperform active management",
      "Time in the market beats timing the market",
      "Behavioral biases can harm investment returns"
    ],
    "cover": "resources/book-covers/random-walk-wall-street.jpg",
    "pages": 496,
    "rating": 4.4,
    "reviews": 6420,
    "price": 19.99,
    "accessLevel": "premium",
    "publishDate": "1973-01-01",
    "tags": ["investing", "efficient market", "index funds"],
    "previewPages": 18
  },
  {
    "id": "b012",
    "title": "The 5 AM Club",
    "author": "Robin Sharma",
    "category": "Motivation",
    "description": "Own Your Morning. Elevate Your Life. Discover the morning routine that has helped millions achieve extraordinary results while upgrading their happiness.",
    "summary": "The 5 AM Club is a revolutionary morning routine that has helped Robin Sharma's clients maximize their productivity, activate their best health, and bulletproof their serenity in this increasingly complex world.",
    "keyLessons": [
      "The first hour of your day determines the quality of your life",
      "The 20/20/20 formula for morning productivity",
      "Victory loves preparation and preparation wins battles",
      "All change is hard at first, messy in the middle, and gorgeous at the end",
      "Small daily improvements lead to stunning results over time"
    ],
    "cover": "resources/book-covers/5am-club.jpg",
    "pages": 336,
    "rating": 4.3,
    "reviews": 7890,
    "price": 15.99,
    "accessLevel": "premium",
    "publishDate": "2018-12-04",
    "tags": ["morning routine", "productivity", "success"],
    "previewPages": 20
  },
  {
    "id": "b013",
    "title": "You Are a Badass",
    "author": "Jen Sincero",
    "category": "Self Help",
    "description": "How to Stop Doubting Your Greatness and Start Living an Awesome Life. A fresh, entertaining how-to guide for living your best life.",
    "summary": "You Are a Badass is a self-help book that combines personal anecdotes with practical advice to help readers identify and change self-sabotaging beliefs and behaviors that prevent them from achieving their goals.",
    "keyLessons": [
      "Identify and change self-sabotaging beliefs",
      "Create a life you love by taking action",
      "Make money by embracing your awesomeness",
      "Overcome fear and doubt with confidence",
      "Surround yourself with positive influences"
    ],
    "cover": "resources/book-covers/you-are-badass.jpg",
    "pages": 256,
    "rating": 4.2,
    "reviews": 12500,
    "price": 14.99,
    "accessLevel": "free",
    "publishDate": "2013-04-23",
    "tags": ["confidence", "success", "mindset"],
    "previewPages": 25
  },
  {
    "id": "b014",
    "title": "Good Vibes, Good Life",
    "author": "Vex King",
    "category": "Motivation",
    "description": "How Self-Love Is the Key to Unlocking Your Greatness. Learn to change the way you think, feel, speak, and act, and you will begin to change the world.",
    "summary": "Good Vibes, Good Life draws on Vex King's personal experiences to help you find your higher purpose, overcome toxic energy, invite great opportunities into your life, cultivate positive lifestyle habits, and manifest your goals.",
    "keyLessons": [
      "Self-love is the foundation of a good life",
      "Positive thinking creates positive outcomes",
      "Overcome fear and manifest your desires",
      "Cultivate healthy habits and relationships",
      "Find your purpose and live with intention"
    ],
    "cover": "resources/book-covers/good-vibes-good-life.jpg",
    "pages": 288,
    "rating": 4.4,
    "reviews": 6800,
    "price": 16.99,
    "accessLevel": "free",
    "publishDate": "2018-12-04",
    "tags": ["self-love", "positivity", "manifestation"],
    "previewPages": 22
  },
  {
    "id": "b015",
    "title": "Jane Eyre",
    "author": "Charlotte Brontë",
    "category": "Fiction",
    "description": "A classic novel of passion, morality, and social criticism. Follow Jane Eyre's journey from orphaned child to independent woman in Victorian England.",
    "summary": "Jane Eyre follows the emotions and experiences of its eponymous heroine, including her growth to adulthood and her love for Mr. Rochester. The novel contains elements of social criticism and explores themes of morality, religion, and class.",
    "keyLessons": [
      "Integrity and self-respect are more important than social advancement",
      "True love respects individual autonomy",
      "Personal growth requires overcoming adversity",
      "Moral principles should guide life decisions",
      "Independence is essential for self-fulfillment"
    ],
    "cover": "resources/book-covers/jane-eyre.jpg",
    "pages": 507,
    "rating": 4.6,
    "reviews": 19800,
    "price": 8.99,
    "accessLevel": "free",
    "publishDate": "1847-10-16",
    "tags": ["gothic", "romance", "victorian"],
    "previewPages": 35
  },
  {
    "id": "b016",
    "title": "The Call of the Wild",
    "author": "Jack London",
    "category": "Fiction",
    "description": "The story of Buck, a domestic dog who is stolen from his home and sold into service as a sled dog in Alaska, where he reverts to a wild state.",
    "summary": "The Call of the Wild is a short adventure novel by Jack London. The central character of the novel is a dog named Buck. The story opens at a ranch in the Santa Clara Valley of California when Buck is stolen from his home and sold into service as a sled dog in Alaska.",
    "keyLessons": [
      "Survival requires adapting to harsh environments",
      "Civilization is a thin veneer over primal instincts",
      "The call of the wild is stronger than domestication",
      "Leadership is earned through strength and wisdom",
      "Nature is both brutal and beautiful"
    ],
    "cover": "resources/book-covers/call-of-wild.jpg",
    "pages": 172,
    "rating": 4.3,
    "reviews": 12500,
    "price": 7.99,
    "accessLevel": "free",
    "publishDate": "1903-01-01",
    "tags": ["adventure", "nature", "survival"],
    "previewPages": 28
  },
  {
    "id": "b017",
    "title": "Python Crash Course",
    "author": "Eric Matthes",
    "category": "Technology",
    "description": "A Hands-On, Project-Based Introduction to Programming. Learn Python programming quickly with this beginner-friendly guide.",
    "summary": "Python Crash Course is a fast-paced, thorough introduction to Python that will have you writing programs, solving problems, and making things that work in no time. You'll learn about variables, lists, classes, loops, and more.",
    "keyLessons": [
      "Master Python fundamentals and syntax",
      "Build practical projects from scratch",
      "Understand object-oriented programming",
      "Work with data visualization and web applications",
      "Apply best practices for clean, readable code"
    ],
    "cover": "resources/book-covers/python-crash-course.jpg",
    "pages": 544,
    "rating": 4.7,
    "reviews": 4200,
    "price": 39.99,
    "accessLevel": "premium",
    "publishDate": "2015-11-01",
    "tags": ["python", "programming", "beginners"],
    "previewPages": 30
  },
  {
    "id": "b018",
    "title": "Designing Data-Intensive Applications",
    "author": "Martin Kleppmann",
    "category": "Technology",
    "description": "The Big Ideas Behind Reliable, Scalable, and Maintainable Systems. A comprehensive guide to building robust data systems.",
    "summary": "Designing Data-Intensive Applications explores the key principles and practices for building applications that can handle large amounts of data, traffic, and complexity while remaining reliable and maintainable.",
    "keyLessons": [
      "Understand different data models and storage engines",
      "Design for scalability and reliability",
      "Implement effective data replication and partitioning",
      "Handle consistency and consensus in distributed systems",
      "Build maintainable and evolvable applications"
    ],
    "cover": "resources/book-covers/designing-data-applications.jpg",
    "pages": 616,
    "rating": 4.8,
    "reviews": 2800,
    "price": 59.99,
    "accessLevel": "premium",
    "publishDate": "2017-03-16",
    "tags": ["distributed systems", "data engineering", "architecture"],
    "previewPages": 20
  },
  {
    "id": "b019",
    "title": "Emma",
    "author": "Jane Austen",
    "category": "Fiction",
    "description": "A delightful comedy of manners about a young woman who imagines herself an expert matchmaker, but discovers she has much to learn about love and human nature.",
    "summary": "Emma Woodhouse, handsome, clever, and rich, with a comfortable home and happy disposition, seemed to unite some of the best blessings of existence. Yet she makes mistakes in matchmaking that lead to humorous and touching complications.",
    "keyLessons": [
      "True understanding comes from humility",
      "Love often grows from friendship",
      "Social class influences but doesn't determine happiness",
      "Self-knowledge is the beginning of wisdom",
      "Good intentions don't always lead to good outcomes"
    ],
    "cover": "resources/book-covers/emma.jpg",
    "pages": 474,
    "rating": 4.4,
    "reviews": 16500,
    "price": 9.99,
    "accessLevel": "free",
    "publishDate": "1815-12-23",
    "tags": ["romance", "comedy", "regency"],
    "previewPages": 32
  },
  {
    "id": "b020",
    "title": "Little Women",
    "author": "Louisa May Alcott",
    "category": "Fiction",
    "description": "The beloved story of four sisters growing up during the Civil War, learning about life, love, and the importance of family bonds.",
    "summary": "Little Women follows the lives of the four March sisters—Meg, Jo, Beth, and Amy—as they navigate the path from childhood to womanhood against the backdrop of the American Civil War.",
    "keyLessons": [
      "Family bonds provide strength through adversity",
      "Each person must find their own path in life",
      "Material wealth is less important than character",
      "Sisters share a unique and powerful bond",
      "Growing up involves both joy and sacrifice"
    ],
    "cover": "resources/book-covers/little-women.jpg",
    "pages": 449,
    "rating": 4.5,
    "reviews": 22300,
    "price": 8.99,
    "accessLevel": "free",
    "publishDate": "1868-09-30",
    "tags": ["family", "coming of age", "civil war"],
    "previewPages": 38
  }
]
